export const matchingDegreeMap = {
  行政办公: [
    4.774193548, 4.774193548, 4.774193548, 4.693548387, 4.709677419, 4.677419355, 4.161290323,
    4.693548387, 4.5, 4.370967742, 4.516129032, 4.5, 4.596774194, 4.483870968, 4.5, 4.661290323,
    4.306451613, 4.596774194, 4.419354839, 4.370967742, 4.596774194, 4.387096774, 4.467741935,
    4.290322581, 4.516129032, 4.258064516, 4.370967742, 4.274193548, 4.322580645, 4.209677419,
    4.35483871, 4.112903226, 4.032258065, 3.967741935, 3.967741935, 4.290322581, 3.935483871,
    3.822580645,
  ],
  '后勤（含物资管理）': [
    4.535714, 4.428571, 4.464286, 4.428571, 4.428571, 4.607143, 4.214286, 4.428571, 4.321429,
    4.392857, 4.464286, 4.285714, 4.25, 4.428571, 4.285714, 4.428571, 4.142857, 4.428571, 4.321429,
    4.285714, 4.928571, 4.428571, 4.357143, 3.964286, 4.178571, 4, 4.428571, 4.071429, 4.5,
    4.214286, 4.357143, 4.428571, 4.178571, 3.964286, 4.142857, 4.357143, 4.214286, 3.5,
  ],
  '工会、党群管理': [
    4.75, 5, 4.5, 4.916667, 5, 4.583333, 4.833333, 4.75, 4.5, 4.583333, 4.75, 4.5, 4.75, 4.25,
    4.583333, 4.583333, 4.583333, 4.75, 4.583333, 4.833333, 4.416667, 4.083333, 4.416667, 4,
    4.333333, 4.166667, 4.5, 4.333333, 4.416667, 4.583333, 4.25, 4.333333, 3.833333, 4.25, 4.416667,
    4.416667, 3.666667, 4.25,
  ],
  信息化建设与管理: [
    4.875, 4.875, 4.875, 4.75, 4.5, 4.75, 4, 4.5, 4.75, 4.625, 4.75, 4.75, 4.625, 4.875, 4.75,
    4.625, 4.625, 4.75, 4.75, 4.5, 4.625, 4.75, 4.5, 4.625, 4.75, 4.75, 4.75, 4.75, 4.625, 4.75,
    4.625, 4.25, 4.5, 4.75, 4.625, 4.125, 3.625, 4,
  ],
  财务管理: [
    5, 4.75, 4.75, 5, 4.5, 5, 4.25, 4, 5, 4.25, 4.75, 5, 4.75, 5, 4.5, 4.5, 4.5, 4.75, 5, 4, 4,
    4.25, 4.5, 4.5, 4, 4.5, 4, 4.25, 3.5, 3.75, 3.75, 3.75, 3.75, 4.25, 4, 4.25, 4, 2.5,
  ],
  人力资源管理: [
    4.9, 4.8, 4.85, 4.8, 4.65, 4.7, 3.7, 4.45, 4.5, 4.65, 4.55, 4.55, 4.55, 4.4, 4.55, 4.75, 4.55,
    4.7, 4.4, 4.5, 4.35, 4.3, 4.35, 4.4, 4.3, 4.35, 4.15, 4.25, 4.05, 4.1, 4.15, 4.1, 4, 4.15, 4,
    4.2, 3.95, 3.2,
  ],
  '整顿规范（流程）': [
    4.8, 4.75, 4.72, 4.71, 4.56, 4.61, 4.26, 4.54, 4.58, 4.5, 4.51, 4.6, 4.59, 4.55, 4.53, 4.6, 4.5,
    4.59, 4.59, 4.39, 4.73, 4.46, 4.58, 4.3, 4.48, 4.4, 4.57, 4.41, 4.34, 4.38, 4.24, 4.4, 4.25,
    4.18, 4.32, 4.34, 4.1, 3.66,
  ],
  法律事务: [
    5, 5, 5, 5, 5, 5, 4.75, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
    5, 3.75, 3, 4.75,
  ],
  '质量管理（产品）': [
    5, 4.75, 4.75, 4.75, 4.5, 4.75, 4, 4.5, 4.75, 4.75, 4.5, 5, 4.5, 4.5, 4.5, 5, 4.25, 4.5, 4.5,
    4.5, 4.75, 4.75, 4.5, 4.25, 4.25, 4.5, 4.75, 4.5, 4.5, 4, 5, 4.5, 4.5, 4.5, 4.5, 4.5, 3.25,
    4.25,
  ],
  营销管理: [
    4.852678571, 4.84375, 4.821428571, 4.821428571, 4.785714286, 4.745535714, 4.741071429,
    4.732142857, 4.723214286, 4.723214286, 4.723214286, 4.723214286, 4.709821429, 4.705357143,
    4.696428571, 4.696428571, 4.691964286, 4.678571429, 4.674107143, 4.633928571, 4.633928571,
    4.620535714, 4.620535714, 4.571428571, 4.5625, 4.535714286, 4.526785714, 4.522321429,
    4.508928571, 4.5, 4.464285714, 4.388392857, 4.352678571, 4.334821429, 4.316964286, 4.169642857,
    4.017857143, 3.897321429,
  ],
  物流管理: [
    4.65625, 4.663194, 4.663194, 4.684028, 4.602083, 4.515625, 4.302083, 4.572917, 4.609375,
    4.555556, 4.649306, 4.546441, 4.65625, 4.604167, 4.472222, 4.609375, 4.447917, 4.59375,
    4.613596, 4.427083, 4.765625, 4.5625, 4.295139, 4.458333, 4.369792, 4.458333, 4.555556,
    4.385417, 4.416667, 4.34375, 4.215278, 4.666667, 4.208333, 4.236111, 4.114583, 4.680556,
    4.697917, 3.848958,
  ],
};

export const competencyOrder = [
  'confidentiality',
  'dedication',
  'implementation',
  'patience',
  'aggressive',
  'policy',
  'serviceMinded',
  'flexible',
  'coordination',
  'underPressure',
  'organizational',
  'theory',
  'law',
  'teamwork',
  'study',
  'time',
  'approachable',
  'selfControl',
  'operationalSkills',
  'unimpressed',
  'safe',
  'hard',
  'political',
  'create',
  'message',
  'logicalAnalysis',
  'find',
  'dataAnalysis',
  'holistic',
  'rallying',
  'plan',
  'risk',
  'leadingOthers',
  'employPeople',
  'intimidate',
  'norms',
  'firm',
  'writing',
];

export function sortArray(inputArray: [string, string | number][]) {
  const sortedArray: [string, string | number][] = [];
  for (const skill of competencyOrder) {
    const index = inputArray.findIndex(([s]) => s === skill);
    if (index !== -1) {
      sortedArray.push(inputArray[index]);
    }
  }
  return sortedArray;
}

export const competencyMap = {
  灵活应变: '《情境领导力与应变策略》、《沟通与应变技巧》',
  理论知识: '《行业前沿理论研讨》、《烟草企业管理》',
  信息管理: '《数据分析与可视化》、《信息检索与利用》、《信息资源管理》',
  政策解读: '《政策分析与解读》、《行业政策专题研讨》、《烟草行业发展政策解读》',
  书面表达: '《专业文案写作》、《商务写作技巧》',
  全局观念: '《战略管理与规划》、《系统思考与决策》',
  风险意识: '《风险管理基础》、《企业危机管理》、《企业风险案例分析》',
  主动学习: '《自我提升与职业发展》、《自我驱动力培养》',
  洞察发现: '《数据分析与洞察》、《市场调研与分析》',
  创新创造: '《创新思维与方法》、《设计思维与创新实践》',
  敬业尽责: '《高效能人士的七个习惯》、《职业发展规划》',
  操作技能: '《实践操作与模拟训练》、《模拟实训》',
  保密意识: '《保密知识与技能培训》、《保密案例分析与警示教育》、《保密管理与制度》',
  独立自主: '《自我管理与领导》、《拓展训练与挑战课程》',
  遵守规范: '《企业规章制度与流程培训》、《标准化管理与质量控制》、《职业安全与规范》',
  法律法规: '《法律法规基础》、《企业法务与合规管理》、《中华人民共和国烟草专卖法》解读',
  数据分析: '《数据分析与决策》、《统计学基础》、《数据分析工具与软件应用》',
  逻辑分析: '《逻辑思维与问题解决》、《批判性思维与论证》、《逻辑思维训练》',
  执行落实: '《团队执行力提升》、《团队协作与执行力提高》',
  严谨耐心:
    '《经常不耐烦怎么办？教你培养耐心的4种有趣方法》、《结构性思维：职场人的全员必修课》、《沟通的最佳态度》、《如何拥有耐心、职场人需要学会的三个技巧》',
  吃苦耐劳:
    '《职场中的必修课程：职业素养》、《怎样从懈怠中解脱出来？职场必修课：提升工作责任感》 、《职场管理教程》',
  时间管理:
    '《高效职场人必修的时间管理课》、《时间精力管理与个人效能提升》、《时间管理七堂课》、《时间管理：职场高效时间管理方法课》、《极简时间管理》、《超级实用的时间管理课程》、《高效时间管理》',
  统筹规划:
    '《像CEO一样统筹规划》、《行政工作统筹管理高级研修班》、《职场上、如何综合统筹、做可落地的工作计划？培养两个能力！》',
  立场坚定: '共产党员网',
  安全意识:
    '《职业素养及安全生产》、《职场安全教育》、《职场健康与安全》、《办公室安全知识专项培训》、《如何提高员工安全意识》',
  威慑他人: '《中层管理必修课-中流砥柱之管理》',
  领导他人:
    '《2个小时！沉浸式学透领导力底层逻辑！【清华大学公开课全10讲】》、《领导力培训-领导力公开课》、《领导科学与领导力》、《领导力培训—团队管理》',
  政治素养: '共产党员网',
  组织认同: '《中大咨询-烟草行业培训课程》',
  沟通协调:
    '《陈艺新【高情商管理课】沟通技巧课 职场精英系列》、《营造职场和谐沟通》、《【TED演讲】高效沟通十大技巧》 、《高品质的人际沟通——辽宁大学【公开课】》、《高效沟通技巧 Effective Communication Skills》',
  凝聚他人:
    '《团队凝聚力课程 - 如何在工作中实现人心齐、泰山移？》、《团队合作管理》、《打造团队的凝聚力和战斗力》、《管理沟通与团队建设》、《职业情商EQ与团队管理》',
  积极进取: '《6大模块、24个积极特质！成功唤醒自我高人性》',
  抗压能力:
    '《压力与情绪管理》、《12招打造心理复原力》、《职场压力应对与情绪管理》、《抗压小妙招》、《抗压能力出众、关键在于这一点》',
  服务意识:
    '《服务意识与心态》、《客户服务篇 客户服务沟通技巧篇 全1讲》、《抓住服务关键时刻、打造忠诚客户》',
  情绪自控: '《职场情绪自愈力》、《耶鲁大学：如何管理情绪（全35讲）》、《当代职场人的情绪管理术》',
  平易近人: '《高情商沟通》、《亲和力打造——高效沟通及发音训练》、《职场沟通表达与职场人际关系》',
  团队协作:
    '《跨部门冲突与协作-加强协作、提高效率》、《跨部门协作：扫除横向沟通障碍》、《如何促进同级部门沟通协作》、《管理沟通与团队建设》',
  识人用人:
    '《职场识人四象限》、《九型人格——教你如何识人、用人》、《职场识人用人课》、《华为人才战略训练营》',
};
