export const evaluteFormData = [
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '20支网络管理员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '品牌经理',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '货源管理员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '订单管理员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '订货员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '终端专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '客户专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '市场经理',
    对应职能: '营销管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '投放管理员',
    对应职能: '营销管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '营销组',
    岗位名称: '市场经理',
    对应职能: '营销管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '营销组',
    岗位名称: '客户专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '营销组',
    岗位名称: '终端专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '营销部',
    岗位名称: '市场经理',
    对应职能: '营销管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '营销部',
    岗位名称: '客户专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '营销部',
    岗位名称: '终端专员',
    对应职能: '营销管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '会计',
    对应职能: '财务管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '出纳',
    对应职能: '财务管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '资产管理员',
    对应职能: '财务管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '税务管理员',
    对应职能: '财务管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '预算管理员',
    对应职能: '财务管理',
  },
  {
    部门名称: '财务管理中心',
    细分部门: '',
    岗位名称: '财务报告及分析员',
    对应职能: '财务管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '成本核算员',
    对应职能: '财务管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '报账员',
    对应职能: '财务管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '报账员',
    对应职能: '财务管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '信息专员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '督察考评员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '人事管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '劳资管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '培训管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '绩效管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '人事科（职工培训中心、督察考评中心）',
    细分部门: '',
    岗位名称: '鉴定管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '人事劳资员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '督察考评员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '营销组',
    岗位名称: '信息专员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '督察管理员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '人事劳资员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '督察考评员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '营销部',
    岗位名称: '信息专员',
    对应职能: '人力资源管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '信息管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '信息维护员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '网络安全管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '系统管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '数据库管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '程序管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '信息统计员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '信息中心',
    细分部门: '',
    岗位名称: '项目管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '信息管理员',
    对应职能: '信息化建设与管理',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '卷烟产品鉴别检验员',
    对应职能: '质量管理（产品）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '企业管理员',
    对应职能: '质量管理（产品）',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '企业管理员',
    对应职能: '质量管理（产品）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '企业管理员',
    对应职能: '质量管理（产品）',
  },
  {
    部门名称: '内管派驻办',
    细分部门: '',
    岗位名称: '卷烟经营企业监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '纪检监察科（与党组纪检组合署办公）',
    细分部门: '',
    岗位名称: '纪检监察员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '政策法规与体制改革科',
    细分部门: '',
    岗位名称: '规范管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '打假打私管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '专卖稽查员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '证件管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '市场监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '执法监督员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '案件管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '专卖稽查中队长',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '专卖稽查员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '市场监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '证件管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '案件审理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '执法监督员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '规范管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '证件管理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '卷烟经营企业监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '案件审理员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '执法监督员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '市场监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '专卖稽查中队长',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '专卖稽查员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '烟叶企业监管员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '党建监察部',
    岗位名称: '纪检监察员',
    对应职能: '整顿规范（流程）',
  },
  {
    部门名称: '政策法规与体制改革科',
    细分部门: '',
    岗位名称: '法制监督员',
    对应职能: '法律事务',
  },
  {
    部门名称: '政策法规与体制改革科',
    细分部门: '',
    岗位名称: '法律事务员',
    对应职能: '法律事务',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '法规管理员',
    对应职能: '法律事务',
  },
  {
    部门名称: '审计派驻办',
    细分部门: '',
    岗位名称: '审计员',
    对应职能: '法律事务',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '法规管理员',
    对应职能: '法律事务',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '文秘',
    对应职能: '行政办公',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '档案管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '宣传舆情管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '科技管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '文秘',
    对应职能: '行政办公',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '档案管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '营销管理中心',
    细分部门: '',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '专卖监督管理办公室（专卖稽查支队）',
    细分部门: '',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '专卖管理组（内管派驻组、专卖稽查大队）',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '文秘',
    对应职能: '行政办公',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '档案管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    岗位名称: '内部专卖监督员',
    对应职能: '行政办公',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '营销部',
    岗位名称: '综合管理员',
    对应职能: '行政办公',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '基建物业管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '车辆管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '文书管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '投资采购管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '法人治理管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '安全管理科',
    细分部门: '',
    岗位名称: '安全管理员',
    对应职能: '后勤(含物资管理)',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '后勤物业管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '司机',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '安全管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '信息管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '设备管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '安全员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '安全管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '车辆管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '后勤物业管理员',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '综合管理部',
    岗位名称: '司机',
    对应职能: '后勤(含物资管理）',
  },
  {
    部门名称: '党建工作科（机关党委办公室、工会办公室）',
    细分部门: '',
    岗位名称: '党务管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '党建工作科（机关党委办公室、工会办公室）',
    细分部门: '',
    岗位名称: '群团管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '党建工作科（机关党委办公室、工会办公室）',
    细分部门: '',
    岗位名称: '企业文化管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '党建工作科（机关党委办公室、工会办公室）',
    细分部门: '',
    岗位名称: '工会管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '党群管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '办公室（企业管理科）',
    细分部门: '',
    岗位名称: '文书管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '城区管理中心',
    细分部门: '综合管理组',
    岗位名称: '党群管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '党建监察部',
    岗位名称: '党群管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '区局（分公司）',
    细分部门: '党建监察部',
    岗位名称: '工会管理员',
    对应职能: '工会、党群管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '仓库管理员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '储备班组长',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '配货管理员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '理货员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '叉车司机',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '分拣员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '送货班组长',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '送货管理员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '送货员',
    对应职能: '物流管理',
  },
  {
    部门名称: '物流配送中心',
    细分部门: '',
    岗位名称: '送货司机',
    对应职能: '物流管理',
  },
];

export const evaluteFormDataObject = {
  营销管理中心: [
    {
      label: '20支网络管理员',
      value: '{"岗位名称":"20支网络管理员","对应职能":"营销管理"}',
    },
    {
      label: '品牌经理',
      value: '{"岗位名称":"品牌经理","对应职能":"营销管理"}',
    },
    {
      label: '货源管理员',
      value: '{"岗位名称":"货源管理员","对应职能":"营销管理"}',
    },
    {
      label: '订单管理员',
      value: '{"岗位名称":"订单管理员","对应职能":"营销管理"}',
    },
    {
      label: '订货员',
      value: '{"岗位名称":"订货员","对应职能":"营销管理"}',
    },
    {
      label: '终端专员',
      value: '{"岗位名称":"终端专员","对应职能":"营销管理"}',
    },
    {
      label: '客户专员',
      value: '{"岗位名称":"客户专员","对应职能":"营销管理"}',
    },
    {
      label: '市场经理',
      value: '{"岗位名称":"市场经理","对应职能":"营销管理"}',
    },
    {
      label: '投放管理员',
      value: '{"岗位名称":"投放管理员","对应职能":"营销管理"}',
    },
  ],
  城区管理中心: [
    {
      label: '市场经理',
      value: '{"岗位名称":"市场经理","对应职能":"营销管理"}',
    },
    {
      label: '客户专员',
      value: '{"岗位名称":"客户专员","对应职能":"营销管理"}',
    },
    {
      label: '终端专员',
      value: '{"岗位名称":"终端专员","对应职能":"营销管理"}',
    },
    {
      label: '报账员',
      value: '{"岗位名称":"报账员","对应职能":"财务管理"}',
    },
    {
      label: '人事劳资员',
      value: '{"岗位名称":"人事劳资员","对应职能":"人力资源管理"}',
    },
    {
      label: '督察考评员',
      value: '{"岗位名称":"督察考评员","对应职能":"人力资源管理"}',
    },
    {
      label: '信息专员',
      value: '{"岗位名称":"信息专员","对应职能":"人力资源管理"}',
    },
    {
      label: '信息管理员',
      value: '{"岗位名称":"信息管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '企业管理员',
      value: '{"岗位名称":"企业管理员","对应职能":"质量管理（产品）"}',
    },
    {
      label: '文秘',
      value: '{"岗位名称":"文秘","对应职能":"行政办公"}',
    },
    {
      label: '档案管理员',
      value: '{"岗位名称":"档案管理员","对应职能":"行政办公"}',
    },
    {
      label: '后勤物业管理员',
      value: '{"岗位名称":"后勤物业管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '司机',
      value: '{"岗位名称":"司机","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '安全管理员',
      value: '{"岗位名称":"安全管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '信息管理员',
      value: '{"岗位名称":"信息管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '专卖稽查中队长',
      value: '{"岗位名称":"专卖稽查中队长","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '专卖稽查员',
      value: '{"岗位名称":"专卖稽查员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '市场监管员',
      value: '{"岗位名称":"市场监管员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '证件管理员',
      value: '{"岗位名称":"证件管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '案件审理员',
      value: '{"岗位名称":"案件审理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '执法监督员',
      value: '{"岗位名称":"执法监督员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '党群管理员',
      value: '{"岗位名称":"党群管理员","对应职能":"工会、党群管理"}',
    },
  ],
  '区局（分公司）': [
    {
      label: '市场经理',
      value: '{"岗位名称":"市场经理","对应职能":"营销管理"}',
    },
    {
      label: '客户专员',
      value: '{"岗位名称":"客户专员","对应职能":"营销管理"}',
    },
    {
      label: '终端专员',
      value: '{"岗位名称":"终端专员","对应职能":"营销管理"}',
    },
    {
      label: '报账员',
      value: '{"岗位名称":"报账员","对应职能":"财务管理"}',
    },
    {
      label: '人事劳资员',
      value: '{"岗位名称":"人事劳资员","对应职能":"人力资源管理"}',
    },
    {
      label: '督察考评员',
      value: '{"岗位名称":"督察考评员","对应职能":"人力资源管理"}',
    },
    {
      label: '信息专员',
      value: '{"岗位名称":"信息专员","对应职能":"人力资源管理"}',
    },
    {
      label: '信息管理员',
      value: '{"岗位名称":"信息管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '企业管理员',
      value: '{"岗位名称":"企业管理员","对应职能":"质量管理（产品）"}',
    },
    {
      label: '规范管理员',
      value: '{"岗位名称":"规范管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '证件管理员',
      value: '{"岗位名称":"证件管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '卷烟经营企业监管员',
      value: '{"岗位名称":"卷烟经营企业监管员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '案件审理员',
      value: '{"岗位名称":"案件审理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '执法监督员',
      value: '{"岗位名称":"执法监督员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '市场监管员',
      value: '{"岗位名称":"市场监管员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '专卖稽查中队长',
      value: '{"岗位名称":"专卖稽查中队长","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '专卖稽查员',
      value: '{"岗位名称":"专卖稽查员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '烟叶企业监管员',
      value: '{"岗位名称":"烟叶企业监管员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '纪检监察员',
      value: '{"岗位名称":"纪检监察员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '文秘',
      value: '{"岗位名称":"文秘","对应职能":"行政办公"}',
    },
    {
      label: '档案管理员',
      value: '{"岗位名称":"档案管理员","对应职能":"行政办公"}',
    },
    {
      label: '综合管理员',
      value: '{"岗位名称":"综合管理员","对应职能":"行政办公"}',
    },
    {
      label: '内部专卖监督员',
      value: '{"岗位名称":"内部专卖监督员","对应职能":"行政办公"}',
    },
    {
      label: '综合管理员',
      value: '{"岗位名称":"综合管理员","对应职能":"行政办公"}',
    },
    {
      label: '安全管理员',
      value: '{"岗位名称":"安全管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '车辆管理员',
      value: '{"岗位名称":"车辆管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '后勤物业管理员',
      value: '{"岗位名称":"后勤物业管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '司机',
      value: '{"岗位名称":"司机","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '党群管理员',
      value: '{"岗位名称":"党群管理员","对应职能":"工会、党群管理"}',
    },
    {
      label: '工会管理员',
      value: '{"岗位名称":"工会管理员","对应职能":"工会、党群管理"}',
    },
  ],
  财务管理中心: [
    {
      label: '会计',
      value: '{"岗位名称":"会计","对应职能":"财务管理"}',
    },
    {
      label: '出纳',
      value: '{"岗位名称":"出纳","对应职能":"财务管理"}',
    },
    {
      label: '资产管理员',
      value: '{"岗位名称":"资产管理员","对应职能":"财务管理"}',
    },
    {
      label: '税务管理员',
      value: '{"岗位名称":"税务管理员","对应职能":"财务管理"}',
    },
    {
      label: '预算管理员',
      value: '{"岗位名称":"预算管理员","对应职能":"财务管理"}',
    },
    {
      label: '财务报告及分析员',
      value: '{"岗位名称":"财务报告及分析员","对应职能":"财务管理"}',
    },
  ],
  物流配送中心: [
    {
      label: '成本核算员',
      value: '{"岗位名称":"成本核算员","对应职能":"财务管理"}',
    },
    {
      label: '信息维护员',
      value: '{"岗位名称":"信息维护员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '综合管理员',
      value: '{"岗位名称":"综合管理员","对应职能":"行政办公"}',
    },
    {
      label: '设备管理员',
      value: '{"岗位名称":"设备管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '安全员',
      value: '{"岗位名称":"安全员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '党群管理员',
      value: '{"岗位名称":"党群管理员","对应职能":"工会、党群管理"}',
    },
    {
      label: '仓库管理员',
      value: '{"岗位名称":"仓库管理员","对应职能":"物流管理"}',
    },
    {
      label: '储备班组长',
      value: '{"岗位名称":"储备班组长","对应职能":"物流管理"}',
    },
    {
      label: '配货管理员',
      value: '{"岗位名称":"配货管理员","对应职能":"物流管理"}',
    },
    {
      label: '理货员',
      value: '{"岗位名称":"理货员","对应职能":"物流管理"}',
    },
    {
      label: '叉车司机',
      value: '{"岗位名称":"叉车司机","对应职能":"物流管理"}',
    },
    {
      label: '分拣员',
      value: '{"岗位名称":"分拣员","对应职能":"物流管理"}',
    },
    {
      label: '送货班组长',
      value: '{"岗位名称":"送货班组长","对应职能":"物流管理"}',
    },
    {
      label: '送货管理员',
      value: '{"岗位名称":"送货管理员","对应职能":"物流管理"}',
    },
    {
      label: '送货员',
      value: '{"岗位名称":"送货员","对应职能":"物流管理"}',
    },
    {
      label: '送货司机',
      value: '{"岗位名称":"送货司机","对应职能":"物流管理"}',
    },
  ],
  信息中心: [
    {
      label: '网络安全管理员',
      value: '{"岗位名称":"网络安全管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '系统管理员',
      value: '{"岗位名称":"系统管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '数据库管理员',
      value: '{"岗位名称":"数据库管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '程序管理员',
      value: '{"岗位名称":"程序管理员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '信息统计员',
      value: '{"岗位名称":"信息统计员","对应职能":"信息化建设与管理"}',
    },
    {
      label: '项目管理员',
      value: '{"岗位名称":"项目管理员","对应职能":"信息化建设与管理"}',
    },
  ],
  '办公室（企业管理科）': [
    {
      label: '企业管理员',
      value: '{"岗位名称":"企业管理员","对应职能":"质量管理（产品）"}',
    },
    {
      label: '文秘',
      value: '{"岗位名称":"文秘","对应职能":"行政办公"}',
    },
    {
      label: '档案管理员',
      value: '{"岗位名称":"档案管理员","对应职能":"行政办公"}',
    },
    {
      label: '宣传舆情管理员',
      value: '{"岗位名称":"宣传舆情管理员","对应职能":"行政办公"}',
    },
    {
      label: '科技管理员',
      value: '{"岗位名称":"科技管理员","对应职能":"行政办公"}',
    },
    {
      label: '基建物业管理员',
      value: '{"岗位名称":"基建物业管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '车辆管理员',
      value: '{"岗位名称":"车辆管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '文书管理员',
      value: '{"岗位名称":"文书管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '投资采购管理员',
      value: '{"岗位名称":"投资采购管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '法人治理管理员',
      value: '{"岗位名称":"法人治理管理员","对应职能":"后勤(含物资管理）"}',
    },
    {
      label: '文书管理员',
      value: '{"岗位名称":"文书管理员","对应职能":"工会、党群管理"}',
    },
  ],
  '专卖监督管理办公室（专卖稽查支队）': [
    {
      label: '卷烟产品鉴别检验员',
      value: '{"岗位名称":"卷烟产品鉴别检验员","对应职能":"质量管理（产品）"}',
    },
    {
      label: '打假打私管理员',
      value: '{"岗位名称":"打假打私管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '专卖稽查员',
      value: '{"岗位名称":"专卖稽查员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '证件管理员',
      value: '{"岗位名称":"证件管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '市场监管员',
      value: '{"岗位名称":"市场监管员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '执法监督员',
      value: '{"岗位名称":"执法监督员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '案件管理员',
      value: '{"岗位名称":"案件管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '综合管理员',
      value: '{"岗位名称":"综合管理员","对应职能":"行政办公"}',
    },
  ],
  内管派驻办: [
    {
      label: '卷烟经营企业监管员',
      value: '{"岗位名称":"卷烟经营企业监管员","对应职能":"整顿规范（流程）"}',
    },
  ],
  政策法规与体制改革科: [
    {
      label: '规范管理员',
      value: '{"岗位名称":"规范管理员","对应职能":"整顿规范（流程）"}',
    },
    {
      label: '法制监督员',
      value: '{"岗位名称":"法制监督员","对应职能":"法律事务"}',
    },
    {
      label: '法律事务员',
      value: '{"岗位名称":"法律事务员","对应职能":"法律事务"}',
    },
  ],
  审计派驻办: [
    {
      label: '审计员',
      value: '{"岗位名称":"审计员","对应职能":"法律事务"}',
    },
  ],
  '人事科（职工培训中心、督察考评中心）': [
    {
      label: '督察考评员',
      value: '{"岗位名称":"督察考评员","对应职能":"人力资源管理"}',
    },
    {
      label: '人事管理员',
      value: '{"岗位名称":"人事管理员","对应职能":"人力资源管理"}',
    },
    {
      label: '劳资管理员',
      value: '{"岗位名称":"劳资管理员","对应职能":"人力资源管理"}',
    },
    {
      label: '培训管理员',
      value: '{"岗位名称":"培训管理员","对应职能":"人力资源管理"}',
    },
    {
      label: '绩效管理员',
      value: '{"岗位名称":"绩效管理员","对应职能":"人力资源管理"}',
    },
    {
      label: '鉴定管理员',
      value: '{"岗位名称":"鉴定管理员","对应职能":"人力资源管理"}',
    },
  ],
  '党建工作科（机关党委办公室、工会办公室）': [
    {
      label: '党务管理员',
      value: '{"岗位名称":"党务管理员","对应职能":"工会、党群管理"}',
    },
    {
      label: '群团管理员',
      value: '{"岗位名称":"群团管理员","对应职能":"工会、党群管理"}',
    },
    {
      label: '企业文化管理员',
      value: '{"岗位名称":"企业文化管理员","对应职能":"工会、党群管理"}',
    },
    {
      label: '工会管理员',
      value: '{"岗位名称":"工会管理员","对应职能":"工会、党群管理"}',
    },
  ],
  '纪检监察科（与党组纪检组合署办公）': [
    {
      label: '纪检监察员',
      value: '{"岗位名称":"纪检监察员","对应职能":"整顿规范（流程）"}',
    },
  ],
  安全管理科: [
    {
      label: '安全管理员',
      value: '{"岗位名称":"安全管理员","对应职能":"后勤(含物资管理)"}',
    },
  ],
};

export const evaluteFormDataSubDepartment = {
  城区管理中心: [
    {
      label: '营销组',
      value: '营销组',
    },
    {
      label: '综合管理组',
      value: '综合管理组',
    },
    {
      label: '专卖管理组（内管派驻组、专卖稽查大队）',
      value: '专卖管理组（内管派驻组、专卖稽查大队）',
    },
  ],
  '区局（分公司）': [
    {
      label: '营销部',
      value: '营销部',
    },
    {
      label: '综合管理部',
      value: '综合管理部',
    },
    {
      label: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
      value: '专卖监督管理办公室（内管派驻组、专卖稽查大队）',
    },
    {
      label: '党建监察部',
      value: '党建监察部',
    },
  ],
};
